Revit 2026 API

# IFCExportOptionsAssign Method

---

Assigns the values of the IFCExportOptions to this options object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Assign(
	IFCExportOptions sourceOptions
)
```
```vb
Public Sub Assign (
	sourceOptions As IFCExportOptions
)
```
```cpp
public:
void Assign(
	IFCExportOptions^ sourceOptions
)
```
```fsharp
member Assign :
        sourceOptions : IFCExportOptions -> unit
```

#### Parameters

sourceOptions IFCExportOptions
     The source IFCExportOptions.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCExportOptions Class

Autodesk.Revit.DB Namespace